alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * GD32G5x3 bridge HAL backend -- DMA-paced ADC streaming + the FAC/FFT
 * register-level DSP pump.  Split move-only from hal/bridge_hw_gd32.c
 * (fw v0.2.8); see hal/gd32/init.c for the backend-wide implementation
 * notes.  The DSP-chain POOL and bind-time validation moved out to
 * hal/gd32/adc_dsp_chain.c (#69/#70) -- see adc_dsp_chain.h.
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "bridge_hw.h"
#include "gd32g5x3.h"

#include "adc_dsp_chain.h"
#include "bridge_critical.h"
#include "gd32_common.h"

/* Stream slots; layout + sizing doc in gd32_common.h. */
adc_stream_state_t adc_streams[BRIDGE_ADC_STREAM_COUNT];

/* NVIC priority for the per-stream DMA "lap" ISR (full-transfer-
 * finish).  Below every transport ISR (SPI/CS = 1, I2C = 2 -- see
 * bridge_board_config.h): a lap tick fires once per ring period
 * (>= ~10 ms at the 100 kHz rate cap) and is pure bookkeeping, so it
 * must never delay the latency-sensitive link ISRs. */
#define ADC_STREAM_LAP_IRQ_PRIO    3u
#define ADC_STREAM_LAP_IRQ_SUBPRIO 0u

/* DMA full-transfer-finish "lap" ISRs -- one per stream (stream 0 ->
 * DMA0 CH0, stream 1 -> DMA1 CH0, fixed in stream_begin below).  The
 * circular channel raises FTF exactly once per ring reload, so
 * lap_count * RING_SAMPLES + the live write index is the TOTAL sample
 * count the DMA has ever deposited -- the writer half of the overrun
 * accounting in bridge_hw_adc_stream_read.  Strong definitions
 * override the vendor startup's weak Default_Handler aliases
 * (CMSIS/GD/GD32G5x3/Source/GCC/startup_gd32g5x3.S). */
void DMA0_Channel0_IRQHandler(void)
{
	if (dma_interrupt_flag_get(DMA0, DMA_CH0, DMA_INT_FLAG_FTF) != RESET) {
		dma_interrupt_flag_clear(DMA0, DMA_CH0, DMA_INT_FLAG_FTF);
		adc_streams[0].lap_count++;
	}
}

void DMA1_Channel0_IRQHandler(void)
{
	if (dma_interrupt_flag_get(DMA1, DMA_CH0, DMA_INT_FLAG_FTF) != RESET) {
		dma_interrupt_flag_clear(DMA1, DMA_CH0, DMA_INT_FLAG_FTF);
		adc_streams[1].lap_count++;
	}
}

/* TRIGSEL route target for an ADC peripheral's routine-group trigger. */
static trigsel_periph_enum adc_stream_routrg(uint32_t adc_periph)
{
	if (adc_periph == ADC1) return TRIGSEL_OUTPUT_ADC1_ROUTRG;
	if (adc_periph == ADC2) return TRIGSEL_OUTPUT_ADC2_ROUTRG;
	if (adc_periph == ADC3) return TRIGSEL_OUTPUT_ADC3_ROUTRG;
	return TRIGSEL_OUTPUT_ADC0_ROUTRG;
}

/* DMA write-cursor read.  The DMA channel counter counts DOWN from
 * the configured transfer length; converting to a write index uses
 * `ring_samples - remaining`.  Wraps naturally via the circular-mode
 * reload. */
static uint16_t adc_stream_write_index(const adc_stream_state_t *s)
{
	const uint32_t remaining =
	    dma_transfer_number_get(s->dma_periph, (dma_channel_enum)s->dma_channel);
	if (remaining > BRIDGE_ADC_STREAM_RING_SAMPLES) return 0u;
	return (uint16_t)(BRIDGE_ADC_STREAM_RING_SAMPLES - remaining);
}

int bridge_hw_adc_stream_begin(uint8_t stream_id, uint8_t channel, uint32_t sample_rate_hz)
{
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;
	if (channel >= ADC_CHANNEL_MAP_COUNT) return BRIDGE_HW_ERR_RANGE;
	if (sample_rate_hz == 0u) return BRIDGE_HW_ERR_INVAL;
	if (sample_rate_hz > BRIDGE_ADC_STREAM_RATE_MAX_HZ) return BRIDGE_HW_ERR_RANGE;
	if (!vref_ready_check()) return BRIDGE_HW_ERR_IO; /* dead reference -- fail loud */

	adc_stream_state_t *s = &adc_streams[stream_id];
	if (s->in_use) return BRIDGE_HW_ERR_INVAL; /* stream already running */

	const gd32_adc_ch_t *ch = &adc_channels_map[channel];

	/* One stream per ADC converter: both streams sharing a peripheral
     * would fight over routine rank 0 AND the TRIGSEL routine-trigger
     * route -- the second begin would silently re-pace and re-point
     * the first.  Refuse honestly instead. */
	for (uint8_t i = 0u; i < BRIDGE_ADC_STREAM_COUNT; ++i) {
		if (i != stream_id && adc_streams[i].in_use &&
		    adc_channels_map[adc_streams[i].channel].periph == ch->periph) {
			return BRIDGE_HW_ERR_INVAL;
		}
	}

	/* Stream 0 -> DMA0, stream 1 -> DMA1.  Channel 0 of each DMA
     * controller is the first free slot in the GD32G5x3 dma_channel
     * enum; bridge brings up no other DMA users today so collisions
     * are not a concern. */
	s->dma_periph  = (stream_id == 0u) ? DMA0 : DMA1;
	s->dma_channel = (uint8_t)DMA_CH0;
	s->pace_timer  = (stream_id == 0u) ? TIMER5 : TIMER6;

	/* The DMAMUX request routing dma_init() writes below lands on a
     * clock-gated register unless the mux clock is up.  The SPI
     * transport happens to enable it first at boot today -- own the
     * dependency here instead of relying on bring-up order (silicon
     * 2026-06-04 audit: an I2C-only build would stream zero samples). */
	rcu_periph_clock_enable(RCU_DMAMUX);
	rcu_periph_clock_enable((stream_id == 0u) ? RCU_DMA0 : RCU_DMA1);
	dma_deinit(s->dma_periph, (dma_channel_enum)s->dma_channel);

	dma_parameter_struct init;
	dma_struct_para_init(&init); /* all fields defined before the explicit set */
	init.periph_addr  = (uint32_t)(uintptr_t)&ADC_RDATA(ch->periph);
	init.memory_addr  = (uint32_t)(uintptr_t)s->ring;
	init.direction    = DMA_PERIPHERAL_TO_MEMORY;
	init.number       = BRIDGE_ADC_STREAM_RING_SAMPLES;
	init.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
	init.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
	init.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
	init.memory_width = DMA_MEMORY_WIDTH_16BIT;
	init.priority     = DMA_PRIORITY_MEDIUM;
	/* DMAMUX request: route the channel to this ADC instance.  Without
     * this the request id is left uninitialised and the channel triggers
     * on the wrong (or no) source. */
	init.request = (ch->periph == ADC1)   ? DMA_REQUEST_ADC1
	               : (ch->periph == ADC2) ? DMA_REQUEST_ADC2
	               : (ch->periph == ADC3) ? DMA_REQUEST_ADC3
	                                      : DMA_REQUEST_ADC0;
	dma_init(s->dma_periph, (dma_channel_enum)s->dma_channel, &init);

	/* Circular mode -- DMA reloads `number` after each cycle so the
     * channel keeps running without firmware re-arms.  Combined with
     * adc_dma_mode_enable below this produces a steady-state
     * peripheral-to-ring pipeline with no firmware in the hot path. */
	dma_circulation_enable(s->dma_periph, (dma_channel_enum)s->dma_channel);

	/* Reconfigure the converter for streaming with ADCON CLEAR, in
     * the vendor's proven order (Examples/ADC/ADC0_routine_channel_
     * with_DMA): mode + trigger + DMA controls all land BEFORE the
     * enable.  Programming CTL1 on an already-running converter is
     * exactly how the v0.2.3 stream silently produced zero samples.
     * Calibration IS redone below, after ADCON re-enables: an ADCON
     * toggle does NOT preserve the boot calibration from
     * adc_periph_init (UM Rev1.2 p.424: the factor is applied only
     * "until the next ADC power-off", and clearing ADCON IS that
     * power-off, p.447) -- and the recalibration is bounded
     * (adc_calibrate_bounded), so it is not the unbounded vendor spin
     * this comment used to worry about (#34). */
	/* Claim the shared converter for the reconfigure below (#133).  The
     * stream-vs-stream scan above says nothing about a single-shot
     * bridge_hw_adc_read in flight on the sibling bridge channel, and
     * that read holds this same flag for its whole convert loop -- so a
     * BEGIN that lands mid-read is told BUSY instead of re-pointing
     * routine rank 0 out from under it.  Long-term ownership stays with
     * the in_use publication; this flag only covers the window in which
     * the converter is being reprogrammed -- which now also spans the
     * bounded recalibration above, since that too runs on the shared
     * converter and must not race a sibling read. */
	if (!adc_periph_claim(ch->periph)) return BRIDGE_HW_ERR_BUSY;

	adc_disable(ch->periph);
	/* Apply the channel's cached resolution + oversample while the
	 * converter is disabled (DRES/OVSAMPCTL only latch with ADCON==0).
	 * In oversampling mode each pacing-timer trigger runs all `ratio`
	 * conversions before one DMA beat lands, so an over-asked rate
	 * degrades exactly as the un-oversampled path documents. */
	adc_apply_conv_format(ch->periph, channel);
	adc_routine_channel_config(ch->periph, 0u, ch->channel, adc_sample_cycles_cache[channel]);

	/* Each pacing-timer TRGO edge starts exactly ONE routine
     * conversion -- the honest realisation of `sample_rate_hz`.  No
     * continuous mode: the silicon ignores trigger edges that land
     * mid-conversion, so an over-asked rate degrades to the channel's
     * achievable rate instead of corrupting the ring. */
	adc_external_trigger_config(ch->periph, ADC_ROUTINE_CHANNEL, EXTERNAL_TRIGGER_RISING);

