alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	/* Release the DSP chain bound to this stream back to the pool.
     * chain_open is the ONLY allocator (sets in_use=true) and nothing
     * else clears it, so without this the 4-slot pool leaks one chain
     * per bind->end cycle -- after BRIDGE_DSP_MAX_CHAINS cycles
     * chain_open returns NOSUPPORT forever until a reboot (#496).
     * dsp_chain_id is only meaningful while dsp_bound, so gate on it. */
	if (s->dsp_bound) {
		adc_dsp_fac_release(stream_id); /* free the FAC if this stream owned it */
		adc_dsp_fft_release(stream_id); /* free the FFT if this stream owned it */
		adc_dsp_chain_release(s->dsp_chain_id);
	}

	s->in_use    = false;
	s->dsp_bound = false;
	return restored ? BRIDGE_HW_OK : BRIDGE_HW_ERR_IO;
}

/* v0.5 (§2B wave-2) chunked DSP-chain upload -- the pool, chain_open,
 * stage_push, adc_dsp_stage_blob_valid, chain_release and chain_bind
 * (plus the shared adc_dsp_chain_p1_capable() capability predicate and
 * the FAC/FFT busy checks it and chain_bind both use) now live in
 * adc_dsp_chain.c (#69/#70 host-testability split -- see that file's
 * header comment).  adc_dsp_chain.h, included above, is this file's
 * only remaining dependency on that pool: the pump-side config
 * functions below index `adc_dsp_chains[]` directly to decode a bound
 * chain's stage blobs before programming the FAC/FFT registers. */

/* =====================================================================
 * #496 FAC FIR/IIR runtime dispatch -- the filtered data plane.
 *
 * A bound FIR/IIR chain routes the raw ADC stream through the GD32 FAC
 * hardware filter (first-lit 2026-07-13: coeffs in X1, DEEP X0 input
 * buffer, clip-enabled, batch or streaming).  The FILTER runs in the
 * base-level pump (bridge_hw_dsp_pump, from the main WFI loop) -- NEVER
 * in stream_read (the CS-EXTI transport handler, prio 1) where even a
 * modest FIR would add link latency (the 2026-06-04 link-rot mode).
 *
 * There is ONE FAC block, so ONE filter stream may be bound at a time;
 * chain_bind rejects a second filter chain with NOSUPPORT
 * (adc_dsp_chain.c: adc_dsp_filter_stream_busy()).
 * ===================================================================== */

/* The FAC/FFT owner byte is shared by the base-level DSP pump and the
 * ISR-side stream teardown. Negative per-stream values are deliberately
 * NOT readable owners: they let release revoke a long configuration or FFT
 * publication while spectrum/data readers treat the block as unavailable
 * (#184/#185/#187). Transitions to/from an active owner are liveness-checked
 * in short PRIMASK critical sections; long hardware work stays interruptible. */
#define ADC_DSP_OWNER_NONE ((int8_t)-1)

static int8_t adc_dsp_owner_transitional(uint8_t stream_id)
{
	return (int8_t)(-2 - (int8_t)stream_id);
}

static bool adc_dsp_owner_live_locked(const volatile int8_t    *owner,
                                      int8_t                    expected_owner,
                                      const adc_stream_state_t *stream,
                                      bool                      fft_terminal)
{
	const bool terminal_matches =
	    fft_terminal ? (stream->dsp_terminal == 3u) : (stream->dsp_terminal != 3u);
	return *owner == expected_owner && stream->in_use && stream->dsp_bound && terminal_matches;
}

static bool adc_dsp_owner_claim_config(volatile int8_t          *owner,
                                       uint8_t                   stream_id,
                                       const adc_stream_state_t *stream,
                                       bool                      fft_terminal)
{
	const uint32_t irq_state = bridge_irq_lock();
	bool           claimed   = false;
	if (*owner == ADC_DSP_OWNER_NONE &&
	    adc_dsp_owner_live_locked(owner, ADC_DSP_OWNER_NONE, stream, fft_terminal)) {
		*owner  = adc_dsp_owner_transitional(stream_id);
		claimed = true;
	}
	bridge_irq_unlock(irq_state);
	return claimed;
}

static bool adc_dsp_owner_commit_config(volatile int8_t          *owner,
                                        uint8_t                   stream_id,
                                        const adc_stream_state_t *stream,
                                        bool                      fft_terminal)
{
	const int8_t   transitional = adc_dsp_owner_transitional(stream_id);
	const uint32_t irq_state    = bridge_irq_lock();
	const bool     live = adc_dsp_owner_live_locked(owner, transitional, stream, fft_terminal);
	if (live) {
		*owner = (int8_t)stream_id;
	} else if (*owner == transitional) {
		/* END may have landed before the configuring claim was visible,
		 * so release could not clear it. Do not leave a negative claim
		 * wedged after the post-config liveness check fails. */
		*owner = ADC_DSP_OWNER_NONE;
	}
	bridge_irq_unlock(irq_state);
	return live;
}

static bool adc_dsp_owner_release(volatile int8_t *owner, uint8_t stream_id)
{
	const int8_t   transitional = adc_dsp_owner_transitional(stream_id);
	const uint32_t irq_state    = bridge_irq_lock();
	const bool     released     = *owner == (int8_t)stream_id || *owner == transitional;
	if (released) *owner = ADC_DSP_OWNER_NONE;
	bridge_irq_unlock(irq_state);
	return released;
}

/* stream_id currently loaded into the FAC, a negative configuring token,
 * or ADC_DSP_OWNER_NONE while the FAC is idle. */
static volatile int8_t adc_dsp_fac_owner = ADC_DSP_OWNER_NONE;

/* Release the FAC if this stream owned it (called from stream_end). */
void adc_dsp_fac_release(uint8_t stream_id)
{
	if (adc_dsp_owner_release(&adc_dsp_fac_owner, stream_id)) {
		fac_stop();
	}
}

/* Decode one wire coefficient (4 bytes little-endian, Q31 or F32) into
 * the FAC's Q15 fixed-point.  Q31 -> arithmetic >>16; F32 -> clamp to
 * [-1, +1) and scale by 2^15. */
static int16_t adc_dsp_coeff_q15(uint8_t fmt, const uint8_t *p)
{
	uint32_t w =
	    (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
	if (fmt == 1u) { /* Q31 */
		return (int16_t)((int32_t)w >> 16);
	}
	/* F32 */
	float f;
	__builtin_memcpy(&f, &w, sizeof(f));
	if (f >= 0.999969f) f = 0.999969f;
	if (f <= -1.0f) f = -1.0f;
	return (int16_t)(f * 32768.0f);
}

/* Configure the FAC for stream s's bound chain (single FIR or single-
 * section IIR -- the only shapes chain_bind now lets through, see
 * adc_dsp_chain_p1_capable() in adc_dsp_chain.c).  Streaming mode:
 * coeffs preloaded into X1, no input preload -- the pump feeds X0 one
 * sample at a time.  chain_bind is where a caller now learns a chain
 * is unrealisable (BRIDGE_HW_ERR_NOTIMPL, #69) -- the `return false`
 * paths below are unreachable in normal operation once bind enforces
 * the shared predicate; they stay only as a defence-in-depth guard
 * against the two sides drifting apart again, in which case the
 * stream is simply left unfiltered. */
static bool adc_dsp_fac_config(const adc_stream_state_t *s)
{
	const adc_dsp_chain_t *chain = &adc_dsp_chains[s->dsp_chain_id];

	/* Defence in depth: chain_bind already refused any chain P1 can't
	 * realise via this SAME predicate -- re-checking it here means a
	 * future capability lift landing on only one side can't silently
	 * reopen the #69 hang.  Since #132 the predicate also re-runs
	 * adc_dsp_stage_blob_valid() over every populated stage, so it
	 * covers the PAYLOAD fields decoded below (the FIR tap count, the
	 * IIR section count, the FFT out_fmt) and not just the chain's
	 * shape -- which is what this comment always claimed. */
	if (!adc_dsp_chain_p1_capable(chain)) return false;

	/* P1 handles exactly one populated non-FFT stage (guaranteed by
	 * the capability check above; find it to decode its blob). */
	const adc_dsp_stage_t *st = 0;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
		if (chain->stages[i].total_size != 0u) {
			st = &chain->stages[i];
			break;
		}
	}
	if (st == 0) return false; /* unreachable post-bind; kept as a defensive guard */

	fac_deinit();
	rcu_periph_clock_enable(RCU_FAC);

	fac_parameter_struct p;
	fac_struct_para_init(&p);
	const uint8_t depth = 32u; /* X0 working depth beyond the tap window */

