alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	if (st->kind == 0u) { /* FIR: format:u8 n_taps:u8 rsvd:u16 taps[] */
		const uint8_t fmt = st->data[0];
		const uint8_t nt  = st->data[1];
		/* Hard bound at the point of use (#132).  The predicate above
		 * already rejects nt == 0 or nt > BRIDGE_DSP_MAX_FIR_TAPS, so
		 * this cannot fire today -- it is here so the array index below
		 * is provably in range from THIS function alone, without the
		 * reader (or a future editor of adc_dsp_chain.c) having to
		 * carry the bound across a translation-unit boundary.  `taps`
		 * lives on the single 2 KB stack that also carries the I2C
		 * ISR's protocol_dispatch() and a nested CS-EXTI ISR, with no
		 * MSPLIM and no stack painting: an overflow here is silent. */
		if (nt == 0u || nt > BRIDGE_DSP_MAX_FIR_TAPS) return false;
		if (st->total_size != (uint16_t)(BRIDGE_DSP_STAGE_HDR_BYTES + (uint16_t)nt * 4u))
			return false;
		int16_t taps[BRIDGE_DSP_MAX_FIR_TAPS];
		for (uint8_t k = 0u; k < nt; ++k) {
			taps[k] =
			    adc_dsp_coeff_q15(fmt, &st->data[BRIDGE_DSP_STAGE_HDR_BYTES + (uint16_t)k * 4u]);
		}
		p.coeff_addr       = 0u;
		p.coeff_size       = nt;
		p.input_addr       = nt;
		p.input_size       = (uint8_t)(nt + depth);
		p.output_addr      = (uint8_t)(nt + nt + depth);
		p.output_size      = depth;
		p.input_threshold  = FAC_THRESHOLD_1;
		p.output_threshold = FAC_THRESHOLD_1;
		p.clip             = FAC_CP_ENABLE;
		fac_init(&p);

		fac_fixed_data_preload_struct pl;
		fac_fixed_data_preload_init(&pl);
		pl.coeffb_ctx  = taps;
		pl.coeffb_size = nt;
		pl.coeffa_ctx  = 0;
		pl.coeffa_size = 0u;
		pl.input_ctx   = 0;
		pl.input_size  = 0u;
		pl.output_ctx  = 0;
		pl.output_size = 0u;
		fac_fixed_buffer_preload(&pl);

		p.func = FUNC_CONVO_FIR;
		p.ipp  = nt;
		p.ipq  = 0u;
		p.ipr  = 0u;
		fac_function_config(&p);
		fac_start();
		return true;
	}

	if (st->kind == 1u) { /* IIR direct-form-1, SINGLE biquad in P1 -- the
	                       * n_sections == 1 limit is enforced by
	                       * adc_dsp_chain_p1_capable() above, not here. */
		const uint8_t fmt = st->data[0];
		/* section = b0,b1,b2,a1,a2 (5 coeffs).  FAC coeffb = feed-
		 * forward B (b0,b1,b2), coeffa = feedback A (a1,a2). */
		int16_t        b[3], a[2];
		const uint8_t *c = &st->data[BRIDGE_DSP_STAGE_HDR_BYTES];
		for (uint8_t k = 0u; k < 3u; ++k)
			b[k] = adc_dsp_coeff_q15(fmt, &c[k * 4u]);
		for (uint8_t k = 0u; k < 2u; ++k)
			a[k] = adc_dsp_coeff_q15(fmt, &c[(3u + k) * 4u]);
		p.coeff_addr       = 0u;
		p.coeff_size       = 5u; /* b0..b2,a1,a2 */
		p.input_addr       = 5u;
		p.input_size       = (uint8_t)(3u + depth);
		p.output_addr      = (uint8_t)(5u + 3u + depth);
		p.output_size      = depth;
		p.input_threshold  = FAC_THRESHOLD_1;
		p.output_threshold = FAC_THRESHOLD_1;
		p.clip             = FAC_CP_ENABLE;
		fac_init(&p);

		fac_fixed_data_preload_struct pl;
		fac_fixed_data_preload_init(&pl);
		pl.coeffb_ctx  = b;
		pl.coeffb_size = 3u;
		pl.coeffa_ctx  = a;
		pl.coeffa_size = 2u;
		pl.input_ctx   = 0;
		pl.input_size  = 0u;
		pl.output_ctx  = 0;
		pl.output_size = 0u;
		fac_fixed_buffer_preload(&pl);

		/* IPP = feed-forward count (3), IPQ = feedback count (2). */
		p.func = FUNC_IIR_DIRECT_FORM_1;
		p.ipp  = 3u;
		p.ipq  = 2u;
		p.ipr  = 0u;
		fac_function_config(&p);
		fac_start();
		return true;
	}

	return false; /* WINDOW/FFT are not filter terminals */
}

/* Drain stream sid's new raw samples through the FAC into its processed
 * ring.  Base-level producer of proc_ring + sole consumer of the raw
 * ring for this stream; mirrors stream_read's exact lap+write-index
 * backlog accounting so a mid-pump DMA reload can only UNDER-count. */
static void adc_dsp_pump_stream(uint8_t sid)
{
	adc_stream_state_t *s = &adc_streams[sid];

	if (adc_dsp_fac_owner != (int8_t)sid) {
		if (!adc_dsp_owner_claim_config(&adc_dsp_fac_owner, sid, s, false)) return;
		if (!adc_dsp_fac_config(s)) {
			(void)adc_dsp_owner_release(&adc_dsp_fac_owner, sid);
			return; /* unsupported chain -> stay idle */
		}
		if (!adc_dsp_owner_commit_config(&adc_dsp_fac_owner, sid, s, false)) {
			/* Config may have resumed and called fac_start() after an ISR-side
			 * release stopped the block. Leave revoked/ended sessions stopped. */
			fac_stop();
			return;
		}
	}

	const uint32_t laps          = s->lap_count;
	const uint16_t w             = adc_stream_write_index(s);
	const uint32_t total_written = laps * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
	int32_t        avail         = (int32_t)(total_written - s->pump_raw_read);
	if (avail <= 0) return;
	if ((uint32_t)avail >= BRIDGE_ADC_STREAM_RING_SAMPLES) {
		/* The pump fell a full ring behind the DMA -- drop the corrupt
		 * backlog and resync so the next batch is gap-free (the host
		 * sees this as a proc-ring gap, same as a raw overrun). */
		const uint32_t irq_state = bridge_irq_lock();
		if (adc_dsp_owner_live_locked(&adc_dsp_fac_owner, (int8_t)sid, s, false)) {
			s->pump_raw_read = total_written;
		}
		bridge_irq_unlock(irq_state);
		return;
	}

	while (avail-- > 0) {
		/* END may pre-empt base level between any two samples. Keep one
		 * FAC input/output transaction and its software cursors atomic with
		 * respect to teardown; the section is only a handful of MMIOs. */
		const uint32_t irq_state = bridge_irq_lock();
		if (!adc_dsp_owner_live_locked(&adc_dsp_fac_owner, (int8_t)sid, s, false)) {
			bridge_irq_unlock(irq_state);
			return;
		}
		const uint16_t ridx = (uint16_t)(s->pump_raw_read % BRIDGE_ADC_STREAM_RING_SAMPLES);
		const uint16_t code = (uint16_t)(s->ring[ridx] & 0x0FFFu); /* 12-bit */
		s->pump_raw_read++;

		/* Unipolar ADC code (0..4095) -> Q15 positive (0..~1.0): <<3.
		 * A unity-DC-gain filter (sum(taps) ~ 1.0) preserves the offset;
		 * the reverse (>>3) returns a code the existing mv math scales. */
		const int16_t x = (int16_t)(code << 3);
		if (fac_flag_get(FAC_FLAG_X0BFF) == SET) {
			bridge_irq_unlock(irq_state);
			break; /* FAC input saturated */
		}
		fac_fixed_data_write(x);

		if (fac_flag_get(FAC_FLAG_YBEF) == RESET) {
			int32_t c = (int32_t)fac_fixed_data_read() >> 3;
			if (c < 0) c = 0;
			if (c > 4095) c = 4095;
			s->proc_ring[s->proc_write % BRIDGE_ADC_STREAM_RING_SAMPLES] = (uint16_t)c;
			s->proc_write++;
		}
		bridge_irq_unlock(irq_state);
	}
}

/* Base-level DSP pump -- called every main-loop tick (bridge_hw_tick).
 * Services every bound FIR/IIR stream; FFT-bound streams have no filter
 * data plane (spectrum is pulled separately). */
void bridge_hw_dsp_pump(void)
{
	for (uint8_t sid = 0u; sid < BRIDGE_ADC_STREAM_COUNT; ++sid) {
		const adc_stream_state_t *s = &adc_streams[sid];
		if (!s->in_use || !s->dsp_bound) continue;
		if (s->dsp_terminal == 3u)
			adc_dsp_pump_fft(sid); /* spectrum path */
		else
			adc_dsp_pump_stream(sid); /* FIR/IIR path */
	}
}

/* =====================================================================
 * #496 FFT spectrum path -- WINDOW+FFT terminal chains.
 *
 * The GD32 FFT block (first-lit 2026-07-13; FLOAT real-in / complex-out)
 * transforms a full N-sample window of the ADC stream into a spectrum.
 * Like the FAC there is ONE block, so ONE FFT stream at a time.  The
 * base-level pump accumulates raw samples into a float window; when the
 * window fills it runs the HW FFT (HW-windowed if the chain has a WINDOW
 * stage), reduces to the requested output format, bumps a frame seq, and
 * refills.  The host pulls the latest frame with CMD_ADC_SPECTRUM_READ.
 * ===================================================================== */
/* F3 (review of #69/#70): this is a compile-time ALIAS of
 * BRIDGE_DSP_MAX_FFT_POINTS (adc_dsp_chain.h), not an independently-
 * maintained copy.  Before this fix the two were separately-defined
 * constants that happened to agree (both 1024) -- raising
 * BRIDGE_DSP_MAX_FFT_POINTS alone would have let chain_bind accept an
 * n_points the FFT buffers below are not sized for, so adc_dsp_fft_config
 * would then always fail post-bind and CMD_ADC_SPECTRUM_READ would
 * answer IO forever: the #69 silent-starvation shape, regenerated
 * through this one limit.  Aliasing makes that divergence impossible;
 * bumping the point cap is now a single-macro edit that resizes these
 * buffers automatically. */
#define ADC_DSP_FFT_MAX_POINTS BRIDGE_DSP_MAX_FFT_POINTS

