alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
/* Active stream ID, negative configuration/publication token, or idle. */
static volatile int8_t   adc_dsp_fft_owner = ADC_DSP_OWNER_NONE;
static uint16_t          adc_dsp_fft_points;
static uint8_t           adc_dsp_fft_outfmt; /* 0 complex / 1 mag / 2 mag-onesided */
static uint16_t          adc_dsp_fft_fill;
static volatile uint32_t adc_dsp_fft_seq;   /* completed-frame counter */
static uint16_t          adc_dsp_fft_nbins; /* bins in the current frame */
static float             adc_dsp_fft_real[ADC_DSP_FFT_MAX_POINTS];
static float             adc_dsp_fft_out[ADC_DSP_FFT_MAX_POINTS * 2u]; /* re,im */
static float             adc_dsp_fft_wcoef[ADC_DSP_FFT_MAX_POINTS];
static float             adc_dsp_fft_bins[ADC_DSP_FFT_MAX_POINTS * 2u]; /* published */

/* Start a new FFT publication session. The bins may keep their old bytes,
 * but seq == 0 gates every read until the new session publishes a complete
 * frame; keeping these three fields together prevents a lifecycle path from
 * reporting an old sequence as a readable (but empty) new-session frame
 * (#140). */
static void adc_dsp_fft_session_reset(void)
{
	adc_dsp_fft_fill  = 0u;
	adc_dsp_fft_seq   = 0u;
	adc_dsp_fft_nbins = 0u;
}

static uint8_t adc_dsp_fft_point_enum(uint16_t n)
{
	switch (n) {
	case 32u:
		return FFT_POINT_32;
	case 64u:
		return FFT_POINT_64;
	case 128u:
		return FFT_POINT_128;
	case 256u:
		return FFT_POINT_256;
	default:
		break;
	}
	/* 512 / 1024 continue the enum (see gd32g5x3_fft.h). */
	if (n == 512u) return (uint8_t)(FFT_POINT_256 + 1u);
	return (uint8_t)(FFT_POINT_256 + 2u); /* 1024 */
}

/* Fill the HW window coefficient buffer for a shape (0 rect => flat 1.0,
 * 1 Hann, 2 Hamming, 3 Blackman).  Symmetric window over N points. */
static void adc_dsp_fft_make_window(uint8_t shape, uint16_t n)
{
	const float twopi = 6.28318530718f;
	for (uint16_t i = 0u; i < n; ++i) {
		const float t = (float)i / (float)(n - 1u);
		float       w;
		switch (shape) {
		case 1u:
			w = 0.5f - 0.5f * __builtin_cosf(twopi * t);
			break; /* Hann    */
		case 2u:
			w = 0.54f - 0.46f * __builtin_cosf(twopi * t);
			break; /* Hamming */
		case 3u:
			w = 0.42f - 0.5f * __builtin_cosf(twopi * t) + 0.08f * __builtin_cosf(2.0f * twopi * t);
			break; /* Blackman*/
		default:
			w = 1.0f;
			break; /* rect    */
		}
		adc_dsp_fft_wcoef[i] = w;
	}
}

/* Configure the FFT block + window for stream s's bound FFT chain.
 * chain_bind is now where a FIR/IIR-ahead-of-FFT shape is refused
 * (BRIDGE_HW_ERR_NOTIMPL, #69) -- the checks below are a defence-in-
 * depth re-check via the SAME shared predicate chain_bind uses, not
 * an independent copy of the "WINDOW+FFT only" limit. */
static bool adc_dsp_fft_config(const adc_stream_state_t *s)
{
	const adc_dsp_chain_t *chain = &adc_dsp_chains[s->dsp_chain_id];

	if (!adc_dsp_chain_p1_capable(chain)) return false;

	const adc_dsp_stage_t *fft_st = 0, *win_st = 0;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
		if (chain->stages[i].total_size == 0u) continue;
		if (chain->stages[i].kind == 3u)
			fft_st = &chain->stages[i];
		else if (chain->stages[i].kind == 2u)
			win_st = &chain->stages[i];
		/* No other kind can be populated here -- guaranteed by the
		 * capability check above. */
	}
	if (fft_st == 0) return false; /* unreachable post-bind; kept as a defensive guard */

	const uint16_t n   = (uint16_t)(fft_st->data[0] | ((uint16_t)fft_st->data[1] << 8));
	const uint8_t  ofm = fft_st->data[2];
	/* F3 (review of #69/#70): adc_dsp_chain_p1_capable() above now folds
	 * in this same bound (BRIDGE_DSP_MIN_FFT_POINTS/MAX_FFT_POINTS,
	 * which ADC_DSP_FFT_MAX_POINTS aliases) -- unreachable post-bind,
	 * kept as a defensive guard against the two checks drifting apart. */
	if (n < BRIDGE_DSP_MIN_FFT_POINTS || n > ADC_DSP_FFT_MAX_POINTS) return false;

	adc_dsp_fft_points = n;
	adc_dsp_fft_outfmt = ofm;
	adc_dsp_fft_session_reset();

	const uint8_t shape = (win_st != 0) ? win_st->data[0] : 0u;

	fft_deinit();
	rcu_periph_clock_enable(RCU_FFT);
	fft_parameter_struct f;
	fft_struct_para_init(&f);
	f.mode_sel     = FFT_MODE;
	f.point_num    = adc_dsp_fft_point_enum(n);
	f.downsamp_sel = FFT_DOWNSAMPLE_1;
	f.image_source = FFT_IM_ZERO;
	f.real_addr    = (uint32_t)(uintptr_t)adc_dsp_fft_real;
	f.image_addr   = 0u;
	f.output_addr  = (uint32_t)(uintptr_t)adc_dsp_fft_out;
	if (win_st != 0 || shape != 0u) {
		adc_dsp_fft_make_window(shape, n);
		f.window_enable = FFT_WINDOW_ENABLE;
		f.window_addr   = (uint32_t)(uintptr_t)adc_dsp_fft_wcoef;
	} else {
		f.window_enable = FFT_WINDOW_DISABLE;
		f.window_addr   = 0u;
	}
	fft_init(&f);
	return true;
}

/* Reduce the FFT block's complex output into the pending bin buffer. The
 * caller publishes nbins + sequence only after revalidating the owner lease. */
static uint16_t adc_dsp_fft_prepare_bins(void)
{
	const uint16_t n = adc_dsp_fft_points;
	if (adc_dsp_fft_outfmt == 0u) { /* COMPLEX: re,im interleaved, 2N */
		for (uint16_t i = 0u; i < n * 2u; ++i)
			adc_dsp_fft_bins[i] = adc_dsp_fft_out[i];
		return (uint16_t)(n * 2u);
	} else { /* MAGNITUDE (N) or MAGNITUDE_ONESIDED (N/2+1) */
		const uint16_t nb = (adc_dsp_fft_outfmt == 2u) ? (uint16_t)(n / 2u + 1u) : n;
		for (uint16_t i = 0u; i < nb; ++i) {
			const float re      = adc_dsp_fft_out[i * 2u];
			const float im      = adc_dsp_fft_out[i * 2u + 1u];
			adc_dsp_fft_bins[i] = __builtin_sqrtf(re * re + im * im);
		}
		return nb;
	}
}

/* Pump the FFT path for stream sid: accumulate new raw samples into the
 * float window; on a full window run the HW FFT and publish. */
static void adc_dsp_pump_fft(uint8_t sid)
{
	adc_stream_state_t *s = &adc_streams[sid];

	if (adc_dsp_fft_owner != (int8_t)sid) {
		/* A negative configuring token is visible to release but never to
		 * spectrum_read, so no stale sequence becomes readable before the
		 * config path resets this session (#140/#184). */
		if (!adc_dsp_owner_claim_config(&adc_dsp_fft_owner, sid, s, true)) return;
		if (!adc_dsp_fft_config(s)) {
			(void)adc_dsp_owner_release(&adc_dsp_fft_owner, sid);
			return;
		}
		if (!adc_dsp_owner_commit_config(&adc_dsp_fft_owner, sid, s, true)) return;
		/* pump_raw_read is deliberately NOT rewound here (#70).
		 * chain_bind already seeds it (adc_dsp_chain.c: `s->pump_raw_read
		 * = s->total_read;`) at the moment this stream's chain was
		 * bound; re-seeding it again on every ownership flip is what
		 * converted transient FAC/FFT contention into PERMANENT
		 * starvation -- total_read never advances for an FFT-bound
		 * stream (stream_read bails on dsp_terminal == 3u before
		 * touching it), so this rewind kept resetting the window to the
		 * same frozen value on every pump tick, which never let
		 * adc_dsp_fft_seq leave 0.  UNPROVEN HOST-SIDE: whether the
		 * rewind is needed for a genuine same-stream re-attach (a
		 * stream_end -> chain_release -> later chain_bind on the SAME
		 * sid, where chain_bind's own seed already covers it) is a
		 * question about DMA down-counter semantics and lap-ISR
		 * interleaving that no host harness reproduces -- confirm on a
		 * bench before relying on this. */
	}

	const uint32_t laps          = s->lap_count;
	const uint16_t w             = adc_stream_write_index(s);
	const uint32_t total_written = laps * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
	int32_t        avail         = (int32_t)(total_written - s->pump_raw_read);
	if (avail <= 0) return;
	if ((uint32_t)avail >= BRIDGE_ADC_STREAM_RING_SAMPLES) {
		const uint32_t irq_state = bridge_irq_lock();
		if (adc_dsp_owner_live_locked(&adc_dsp_fft_owner, (int8_t)sid, s, true)) {
			s->pump_raw_read = total_written; /* fell behind -> resync, drop partial window */
			adc_dsp_fft_fill = 0u;
		}
		bridge_irq_unlock(irq_state);
		return;
	}

