alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	while (avail-- > 0) {
		/* Capture the raw code under the session lease, then perform the
		 * soft-float conversion with interrupts enabled. The production
		 * build lowers it to __aeabi_ui2f/__aeabi_fdiv calls, which are far
		 * too long for the bridge's short PRIMASK sections. */
		uint32_t irq_state = bridge_irq_lock();
		if (!adc_dsp_owner_live_locked(&adc_dsp_fft_owner, (int8_t)sid, s, true)) {
			bridge_irq_unlock(irq_state);
			return;
		}
		const uint16_t ridx = (uint16_t)(s->pump_raw_read % BRIDGE_ADC_STREAM_RING_SAMPLES);
		const uint16_t code = (uint16_t)(s->ring[ridx] & 0x0FFFu);
		bridge_irq_unlock(irq_state);
		const float sample = (float)code / 4096.0f;

		irq_state = bridge_irq_lock();
		if (!adc_dsp_owner_live_locked(&adc_dsp_fft_owner, (int8_t)sid, s, true)) {
			bridge_irq_unlock(irq_state);
			return;
		}
		s->pump_raw_read++;
		adc_dsp_fft_real[adc_dsp_fft_fill++] = sample;
		const bool frame_ready               = adc_dsp_fft_fill >= adc_dsp_fft_points;
		if (frame_ready) fft_calculation_start();
		bridge_irq_unlock(irq_state);
		if (!frame_ready) continue;

		/* The completion wait and bin reduction are intentionally
		 * interruptible. END revokes the owner first; the two lease checks
		 * below then prevent this suspended pump from publishing into a
		 * replacement session that reuses the same stream ID. */
		uint32_t g = 0u;
		while (fft_flag_get(FFT_FLAG_CCF) == RESET && ++g < 1000000u) {
		}
		const bool complete = fft_flag_get(FFT_FLAG_CCF) != RESET;

		uint32_t publish_irq_state = bridge_irq_lock();
		if (!complete) {
			const bool still_live =
			    adc_dsp_owner_live_locked(&adc_dsp_fft_owner, (int8_t)sid, s, true);
			if (still_live) adc_dsp_fft_fill = 0u;
			bridge_irq_unlock(publish_irq_state);
			if (!still_live) return;
			continue;
		}

		/* Make the single bin buffer unreadable before reducing into it.
		 * END can revoke this transitional token while the long copy/sqrt
		 * work remains interruptible; spectrum_read reports BUSY instead of
		 * returning old/new bins under one old sequence (#18/#187). */
		const int8_t publishing = adc_dsp_owner_transitional(sid);
		const bool   publishing_claimed =
		    adc_dsp_owner_live_locked(&adc_dsp_fft_owner, (int8_t)sid, s, true);
		if (publishing_claimed) adc_dsp_fft_owner = publishing;
		bridge_irq_unlock(publish_irq_state);
		if (!publishing_claimed) return;

		const uint16_t nbins  = adc_dsp_fft_prepare_bins();
		publish_irq_state     = bridge_irq_lock();
		const bool still_live = adc_dsp_owner_live_locked(&adc_dsp_fft_owner, publishing, s, true);
		if (still_live) {
			adc_dsp_fft_nbins = nbins;
			adc_dsp_fft_seq++;
			adc_dsp_fft_fill  = 0u;
			adc_dsp_fft_owner = (int8_t)sid;
		} else if (adc_dsp_fft_owner == publishing) {
			adc_dsp_fft_owner = ADC_DSP_OWNER_NONE;
		}
		bridge_irq_unlock(publish_irq_state);
		if (!still_live) return;
	}
}

/* Release the FFT block if this stream owned it (stream_end). */
void adc_dsp_fft_release(uint8_t stream_id)
{
	if (adc_dsp_owner_release(&adc_dsp_fft_owner, stream_id)) {
		adc_dsp_fft_session_reset();
	}
}

/* HAL: read spectrum bins (float32 LE) for a bound FFT stream.  Chunked:
 * the host asks for [bin_offset, bin_offset+max_bins); the reply carries
 * the frame seq so the host detects a frame roll mid-fetch.  Returns
 * NOSUPPORT if the stream isn't FFT-bound, IO before the first frame. */
int bridge_hw_adc_spectrum_read(uint8_t   stream_id,
                                uint16_t  bin_offset,
                                uint8_t   max_bins,
                                uint32_t *seq_out,
                                uint16_t *total_bins_out,
                                uint8_t  *got_bins_out,
                                float    *bins_out)
{
	if (seq_out == 0 || total_bins_out == 0 || got_bins_out == 0 || bins_out == 0) {
		return BRIDGE_HW_ERR_INVAL;
	}
	*got_bins_out = 0u;
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;
	adc_stream_state_t *s = &adc_streams[stream_id];
	if (!s->in_use || !s->dsp_bound || s->dsp_terminal != 3u) return BRIDGE_HW_ERR_NOTIMPL;
	if (adc_dsp_fft_owner != (int8_t)stream_id || adc_dsp_fft_seq == 0u) {
		return BRIDGE_HW_ERR_IO; /* no frame yet */
	}

	*seq_out        = adc_dsp_fft_seq;
	*total_bins_out = adc_dsp_fft_nbins;
	if (bin_offset >= adc_dsp_fft_nbins) return BRIDGE_HW_OK; /* past the end */

	uint16_t remain = (uint16_t)(adc_dsp_fft_nbins - bin_offset);
	uint8_t  emit   = (remain < max_bins) ? (uint8_t)remain : max_bins;
	for (uint8_t i = 0u; i < emit; ++i)
		bins_out[i] = adc_dsp_fft_bins[bin_offset + i];
	*got_bins_out = emit;
	return BRIDGE_HW_OK;
}
